app/controllers/dashboard_controller.rb

SELECT "dives".* FROM "dives" WHERE "dives"."user_id" = 652920847
SELECT "dives".* FROM "dives" WHERE (facebook_id)
SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."identifier" = '652920847' LIMIT 1
---
  def show

# Find all examples
#@dives = Dive.all
#Person.all # returns an array of objects for all the rows fetched by SELECT * FROM people
#Person.where(["category IN (?)", categories]).limit(50).all
#Person.where({ :friends => ["Bob", "Steve", "Fred"] }).all
#Person.offset(10).limit(10).all
#Person.includes([:account, :friends]).all
#Person.group("category").all

    @dives = Dive.where(:user_id => current_user.identifier)

    @facebook = Facebook.find(:first, :conditions => [ "identifier", current_user.identifier])