app/controllers/dashboard_controller.rb

  def show
    @logs = Log.all
---
SELECT "logs".* FROM "logs"