app/controllers/dashboard_controller.rb

  def show

    @user = User.where(:facebook_id => current_user.identifier).first

    #raise @user.id.inspect
    #@dives = Dive.all
    @dives = Dive.where(:user_id => @user.id)
    @dive_count = Dive.where(:user_id => @user.id).count

    total_minutes = Dive.where(:user_id => @user.id).sum(:bottomtime)
---
SELECT "users".* FROM "users" WHERE "users"."facebook_id" = 652920847 LIMIT 1
SELECT COUNT(*) FROM "dives" WHERE "dives"."user_id" = 1
SELECT SUM("dives"."bottomtime") AS sum_id FROM "dives" WHERE "dives"."user_id" = 1