app/controllers/dives_controller.rb

SELECT "users".* FROM "users" WHERE "users"."facebook_id" = 652920847 LIMIT 1
SELECT "dives".* FROM "dives" WHERE "dives"."user_id" = 652920847
---
  def index
    @user = User.where(:facebook_id => current_user.identifier).first
    @dives = Dive.where(:user_id => @user.id)

SELECT "dives".* FROM "dives" WHERE "dives"."id" = 1 LIMIT 1
---
  def show
    @dive = Dive.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."facebook_id" = 652920847 LIMIT 1
---
  def new
    @dive = Dive.new

    @user = User.where(:facebook_id => current_user.identifier).first

SELECT "users".* FROM "users" WHERE "users"."facebook_id" = 652920847 LIMIT 1
SELECT "dives".* FROM "dives" WHERE "dives"."id" = 1 LIMIT 1
---
  def edit
    @user = User.where(:facebook_id => current_user.identifier).first
    #@user = User.find_by_facebook_id(current_user.identifier)
    @dive = Dive.find(params[:id])

INSERT INTO "dives" ("units", "depth", "bottomtime", "endtime", "city", "rating", "state", "created_at", "weather", "comments", "name", "description", "temperature", "starttime", "equipment", "weight", "updated_at", "facebook_id", "longitude", "date", "latitude", "directions", "country", "watertemp") VALUES (NULL, 21, 50, '2012-05-04 20:20:00.000000', 'Malibu', 6.0, 'CA', '2012-05-05 00:26:26.751735', 'Clear, mild', 'California, Night dive, 6/10 rating. Many small octopus (~8), a few lobster, Chris attempted to bring home a halibut, but has not yet learned how to capture one.', 'Coral Canyons', 'Great dive location. We went looking for lobster, but ended up having a great time with other fish.', '65', '2012-05-04 19:30:00.000000', '7mm wetsuit, hood, gloves, boots', '16', '2012-05-05 00:26:26.751735', 17, -119.037602, '2011-03-21', 34.216393, 'Across from some restaurant in Malibu.', 'USA', '55')
---
  def create
@user = User.where(:facebook_id => current_user.identifier)
#@dive = @user.dives.create(params[:dive])
@dive = Dive.new(params[:dive])

    respond_to do |format|
      if @dive.save

SELECT "dives".* FROM "dives" WHERE "dives"."id" = 1 LIMIT 1
UPDATE "dives" SET "user_id" = 652920847, "rating" = 1.0, "updated_at" = '2012-05-06 01:17:29.009244' WHERE "dives"."id" = 1
---
  def update
    @dive = Dive.find(params[:id])

    respond_to do |format|
      if @dive.update_attributes(params[:dive])