app/controllers/dives_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "dives".* FROM "dives" WHERE "dives"."id" = 1
---
  def index
    #@dives = Dive.all
    #@user = User.where(:facebook_id => current_user.identifier).first
    #@dives = Dive.where(:user_id => @user.id)
    @user = User.where(:id => current_user.id).first
    @dives = Dive.where(:id => @user.id)