app/controllers/facebooks_controller.rb

  def create
    client = Facebook.auth(callback_facebook_url).client
    client.authorization_code = params[:code]
    access_token = client.access_token! :client_auth_body
    user = FbGraph::User.me(access_token).fetch
    authenticate Facebook.identify(user)

    #TODO: check for an existing user. If one exists and has a facebook_id continue.
    # If one exists with no facebook_id, add facebook_id to user.
    # If one does not exist, create a new user with Facebook email and facebook_id.
    User.find_or_create_by_email_and_facebook_id(facebook_values[:email], facebook_values[:facebook_id])
---
INSERT INTO "facebooks" ("identifier", "created_at", "access_token", "updated_at") VALUES ('652920847', '2012-04-23 07:59:54.753081', 'AAACsOsOvAgABANiHSId5na0aXaSFGrNMMJW9XKg9qIfJJJD5j3c6Qj5GDJ4QrKpn8chvSk81O9sSEHojHqnYx63aGZCYZD', '2012-04-23 07:59:54.753081')