app/controllers/home_controller.rb

SELECT "dives".* FROM "dives" WHERE "dives"."user_id" = 1
---
  def dashboard

    @user = User.where(:id => current_user.id).first
    #raise @user.id.inspect
    #@dives = Dive.all
    #@dives = Dive.find(:all, :order => "id desc", :limit => 5).reverse!

    #raise @user.inspect

    @dives = Dive.where(:id => @user.id)