app/controllers/profiles_controller.rb

SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."id" = 2 LIMIT 1
---
  def show
      @facebook = Facebook.find(:first, :conditions => [ "identifier", current_user.identifier])