app/controllers/profiles_controller.rb

  def show
      @facebook = Facebook.where(:identifier => current_user.identifier).first
      @user = User.where(:facebook_id => current_user.identifier).first
      @dive_count = Dive.where(:user_id => @user.id).count
      total_minutes = Dive.where(:user_id => @user.id).sum(:bottomtime)
---
SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."identifier" = '652920847' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."facebook_id" = 652920847 LIMIT 1
SELECT COUNT(*) FROM "dives" WHERE "dives"."user_id" = 1
SELECT SUM("dives"."bottomtime") AS sum_id FROM "dives" WHERE "dives"."user_id" = 1